# Exploring Data: An Introduction to Pandas and DataFrames

Pandas is a powerful Python library that is essential for data science and analysis. It provides high-performance, easy-to-use data structures, the most important of which is the DataFrame. You can think of a DataFrame as a smart, programmable spreadsheet, like Excel or Google Sheets, but with the full power of Python behind it.

Here we'll look into the structure of a dataframe and walk through the most critical first steps to take immediately after loading a dataset into a pandas as a dataframe. Think of this as the initial "health check" for your data, a fundamental skill for any data analyst or scientist.

Why is this so important? Before you can perform any meaningful analysis, build a model, or create a visualization, you must first understand the data you're working with.  Mastering these first few commands builds a solid foundation for all your future data work and prevents common errors down the line.

## Data Structures (cont.)

We have already seen a couple examples of **structured data**: lists and dictionaries.

### Lists

Lists are **ordered**, meaning the items are labeled using an **index**.

In [1]:
grocery_list = ["eggs", "milk", "juice"]   

# Print "milk"
grocery_list[1]

'milk'

### Arrays

Arrays are a special type of list that contains only one data type. This homogeneity allows for more efficient memory usage and faster numerical computations, making them a favorite in scientific computing. Arrays are typically more rigid than lists.

In [4]:
# Which list is an array?
planet_list = ['mercury', 'venus', 'earth', 'mars', 'jupiter']
age_list = [3, 8, 12.0, 38, 40]
number_list = [4, 'five', 'ten', 32]

list

The key takeaway for both lists and arrays is their integer-based indexing. You retrieve an element by its numerical position, starting from zero.

## The Tabular Powerhouse: DataFrames
Enter the dataframe, a structure that brings together the concepts of lists, arrays, and dictionaries to create a powerful tool for data analysis. A dataframe is a two-dimensional data structure with labeled rows and columns. Imagine a spreadsheet, and you have a good mental model of a dataframe.

## Importing the Pandas Library

In order to have access to the functions in a library, we have to "import" it. This is done with a simple line of code. A common practice it to:

`import <library_name> as <abbreviated_name>`. 

This allows us to define an abbreviation for the library to use whenever we call a function from it instead of typing out the full name of the library every time. The abbreviation is up to you, but most libraries have an agreed upon abbreviation. For examples, most people abbreviate pandas as `pd`:

In [1]:
import pandas as pd

A Pandas dataframe should look familiar. It is how data is structured in spreadsheets like Excel and Google Sheets. The bold numbers on the left are known as the **index** and allow us to number rows. The column names allow us to label and reference individual arrays in the dataframe.

## Reading in Data to a DataFrame a from a .csv File

It is possible to create a dataframe from scratch, but we usualliy will bring in data from an existing file, also known as a **dataset**. The most common file format for raw data is a `.csv` file, short for "comma separated values" and it is very easy to bring into as a dataframe using the `pd.read_csv()` function.

When you use `pd.read_csv('filename.csv')`, you're telling pandas to find a file and load it into a DataFrame. The string you provide inside the parentheses is the **file path**. It's the set of directions from your current location to the file you want.

See the "Supplementary Information" section for more on file paths.

Now we will look at an authentic dataset of historical global temperatures, courtesy of [Berkeley Earth](https://berkeleyearth.org/about/), which is affiliated with [Lawrence Berkeley National Laboratory](https://www.lbl.gov/).

In [2]:
global_temps = pd.read_csv("https://raw.githubusercontent.com/jdomyancich/big-data-camp/refs/heads/main/data/global_temps.csv")

### Getting a First Look

Once you've loaded your dataset into a pandas DataFrame using `pd.read_csv()`, the crucial next step is to get a feel for your data. This initial inspection helps you understand its structure, identify potential issues like missing values, and get a sense of the data's content.

Here are the essential dataframe methods and attributes you should use right away. Remember, a dataframe is an **object**, meaning it has certain **methods** associated with it. In pandas (and Python in general), an **attribute** is a piece of data or a characteristic stored on an object, which you access directly by name. Think of it as a property of the object.

#### `.head()` - View the first few rows
This is the most common first step. It shows you the first 5 rows of your DataFrame by default, giving you an immediate look at your columns and the type of data they contain.

**Why it's useful**: It's a quick way to confirm your data loaded correctly and to see the column names and data examples without printing the entire (potentially massive) dataset.

In [3]:
# Print the first few rows
global_temps.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W

#### `.tail()` - View the last few rows
Similar to `.head()`, this method shows you the last 5 rows of your DataFrame.

**Why it's useful**: This can help you spot any issues with the end of your file, such as summary rows or trailing blank data that might have been loaded incorrectly.

In [10]:
global_temps.tail()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
239172,2013-05-01,18.979,0.807,Xian,China,34.56N,108.97E
239173,2013-06-01,23.522,0.647,Xian,China,34.56N,108.97E
239174,2013-07-01,25.251,1.042,Xian,China,34.56N,108.97E
239175,2013-08-01,24.528,0.840,Xian,China,34.56N,108.97E
239176,2013-09-01,NaN,NaN,Xian,China,34.56N,108.97E

#### `.shape` - Check the dimensions
This is an attribute (not a method, so no parentheses) that returns a tuple representing the dimensions of the DataFrame: `(number_of_rows, number_of_columns)`. 

**Why it's useful**: It tells you exactly how big your dataset is, which is fundamental information for any further analysis.

In [11]:
global_temps.shape

(239177, 7)

#### `.info()` - Get a technical summary

This method provides a concise technical summary of the dataframe. It's one of the most valuable inspection tools.

**Why it's useful**:
- Index type: Shows the index type and range.
- Column count: Confirms the total number of columns.
- Dtype: Shows the data type (e.g., `int64`, `float64`, `object`) for each column. An object dtype often means the column contains strings.
- Memory usage: Gives you an idea of how much memory the dataframe is using.

In [12]:
global_temps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239177 entries, 0 to 239176
Data columns (total 7 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             239177 non-null  object
 1   AverageTemperature             228175 non-null  float64
 2   AverageTemperatureUncertainty  228175 non-null  float64
 3   City                           239177 non-null  object
 4   Country                        239177 non-null  object
 5   Latitude                       239177 non-null  object
 6   Longitude                      239177 non-null  object
dtypes: float64(2), object(5)
memory usage: 12.8+ MB

#### `.describe()` - Generate descriptive statistics

This method generates descriptive statistics for the numerical columns in your dataframe.

**Why it's useful**: It provides a quick overview of the distribution, central tendency, and spread of your numerical data. You can quickly spot things like outliers (e.g., a huge max value) or unexpected distributions.

In [13]:
global_temps.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       228175.000000                  228175.000000
mean            18.125969                       0.969343
std             10.024800                       0.979644
min            -26.772000                       0.040000
25%             12.710000                       0.340000
50%             20.428000                       0.592000
75%             25.918000                       1.320000
max             38.283000                      14.037000

# Data Wrangling

This is one of the hardest parts of working with data. Raw data is rarely ready to be analyzed. Scientists spend a lot of time manipulating their data to get it into a form that can be used. We call it "wrangling".

<img src = 'https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Cats_in_aoshima_island_1.JPG/1600px-Cats_in_aoshima_island_1.JPG' width = 400>

Possible problems with data:
* Getting only the data you need 
* Incorrect data types
* Incorrect units

## Working with Columns

You can think of the data frame from two perspectives: columns and rows. Columns are much easier to work with because they are arrays, meaning all the elements in a column are the same datatype (or they should be).

#### `.columns` - View column names

This attribute returns a list of all the column names in your dataframe.

In [16]:
global_temps.columns

Index(['dt', 'AverageTemperature', 'AverageTemperatureUncertainty', 'City',
       'Country', 'Latitude', 'Longitude'],
      dtype='object')

Sometimes the original column names are confusing. You can change them by setting a list of new column names to `data.columns`

In [20]:
global_temps.columns = ['date', 'ave_temp', 'ave_temp_uncer', 'city', 'country', 'latitude', 'longitude']
global_temps

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W
...,...,...,...,...,...,...,...
239172,2013-05-01,18.979,0.807,Xian,China,34.56N,108.97E
239173,2013-06-01,23.522,0.647,Xian,China,34.56N,108.97E
239174,2013-07-01,25.251,1.042,Xian,China,34.56N,108.97E
239175,2013-08-01,24.528,0.840,Xian,China,34.56N,108.97E
239176,2013-09-01,NaN,NaN,Xian,China,34.56N,108.97E

### Selecting Columns

The most common way to get data from a DataFrame is by selecting one or more columns. Remember, each column is an array, meaning all the elements in a column are the same datatype (or they should be).

#### Selecting a Single Column
To select a single column, use square bracket notation with the column name as a string:

In [22]:
# Select the city column

0         Abidjan
1         Abidjan
2         Abidjan
3         Abidjan
4         Abidjan
           ...
239172       Xian
239173       Xian
239174       Xian
239175       Xian
239176       Xian
Name: city, Length: 239177, dtype: object

#### Selecting Multiple Columns

To select multiple columns, you need to pass a **list** of column names inside the square brackets. This will return a new dataframe.

In [24]:
columns = ["date", "ave_temp", "city"]
selected_columns = global_temps[columns]
selected_columns

              date  ave_temp     city
0       1849-01-01    26.704  Abidjan
1       1849-02-01    27.434  Abidjan
2       1849-03-01    28.101  Abidjan
3       1849-04-01    26.140  Abidjan
4       1849-05-01    25.427  Abidjan
...            ...       ...      ...
239172  2013-05-01    18.979     Xian
239173  2013-06-01    23.522     Xian
239174  2013-07-01    25.251     Xian
239175  2013-08-01    24.528     Xian
239176  2013-09-01       NaN     Xian

[239177 rows x 3 columns]

## Conditional Filtering (Boolean Indexing)

This is one of the most powerful features of Pandas: selecting rows based on whether they meet a certain condition. You pass a Series of `True`/`False` values (a "Boolean Series") inside the square brackets. Only rows where the value is `True` will be returned. The easiest way to undrstand this is by breaking it down, step by step:

**Step 1: Create a condition**

Let's ask a question: "Which cities have experienced very hot average temperature for a specific month?" Let's say 35&deg;C (95&deg;F) is "very hot".

In [26]:
hot_cities = global_temps['ave_temp'] >= 35

**Step 2: Generate the Boolean Series**

If you `print(hot_cities)`, you wouldn't see the cities. You would see the Boolean Series—the `True`/`False` answer for every single city:

In [27]:
print(hot_cities)

0         False
1         False
2         False
3         False
4         False
          ...
239172    False
239173    False
239174    False
239175    False
239176    False
Name: ave_temp, Length: 239177, dtype: bool

**Step 3: Use the Boolean Series to filter the dataframe**
Now, you use that condition (the Boolean Series) as a filter inside the square brackets of your original dataframe.

Pandas will look at your `global_temps` dataframe, and for every row, it will check the corresponding value in your condition series. It will only keep the rows where the value is True.

In [28]:
high_temps = global_temps[hot_cities]
high_temps

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
6514,2010-05-01,35.419,0.376,Ahmadabad,India,23.31N,72.52E
15052,1823-07-01,35.028,1.663,Baghdad,Iraq,32.95N,45.00E
15064,1824-07-01,35.328,2.991,Baghdad,Iraq,32.95N,45.00E
15088,1826-07-01,35.338,1.781,Baghdad,Iraq,32.95N,45.00E
15100,1827-07-01,35.792,1.753,Baghdad,Iraq,32.95N,45.00E
...,...,...,...,...,...,...,...
234745,2010-05-01,35.493,0.336,Umm Durman,Sudan,15.27N,32.50E
234758,2011-06-01,35.356,0.329,Umm Durman,Sudan,15.27N,32.50E
234769,2012-05-01,35.046,1.342,Umm Durman,Sudan,15.27N,32.50E
234770,2012-06-01,35.700,1.779,Umm Durman,Sudan,15.27N,32.50E
234781,2013-05-01,35.285,0.298,Umm Durman,Sudan,15.27N,32.50E

You will often see these steps condensed into a single line of code:

In [29]:
high_temps = global_temps[global_temps['ave_temp'] >= 35]
high_temps

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
6514,2010-05-01,35.419,0.376,Ahmadabad,India,23.31N,72.52E
15052,1823-07-01,35.028,1.663,Baghdad,Iraq,32.95N,45.00E
15064,1824-07-01,35.328,2.991,Baghdad,Iraq,32.95N,45.00E
15088,1826-07-01,35.338,1.781,Baghdad,Iraq,32.95N,45.00E
15100,1827-07-01,35.792,1.753,Baghdad,Iraq,32.95N,45.00E
...,...,...,...,...,...,...,...
234745,2010-05-01,35.493,0.336,Umm Durman,Sudan,15.27N,32.50E
234758,2011-06-01,35.356,0.329,Umm Durman,Sudan,15.27N,32.50E
234769,2012-05-01,35.046,1.342,Umm Durman,Sudan,15.27N,32.50E
234770,2012-06-01,35.700,1.779,Umm Durman,Sudan,15.27N,32.50E
234781,2013-05-01,35.285,0.298,Umm Durman,Sudan,15.27N,32.50E

### Combining Conditions

You can combine multiple conditions using logical operators:

- & for AND (both conditions must be true)
- | for OR (at least one condition must be true)

Remember to put each condition in parentheses!

`(first_condition) & (second_condition)`

In [30]:
condition = (global_temps['country'] == 'India') & (global_temps['ave_temp'] > 36)
hot_india = global_temps[condition]
hot_india

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
64790,1932-06-01,36.005,0.474,Delhi,India,28.13N,77.27E
65546,1995-06-01,36.291,0.338,Delhi,India,28.13N,77.27E
65750,2012-06-01,36.339,0.386,Delhi,India,28.13N,77.27E
98931,1988-05-01,36.076,0.418,Jaipur,India,26.52N,75.22E
99016,1995-06-01,36.031,0.229,Jaipur,India,26.52N,75.22E
99195,2010-05-01,36.477,0.318,Jaipur,India,26.52N,75.22E
162009,1921-05-01,36.038,0.514,Nagpur,India,21.70N,78.75E
162813,1988-05-01,36.052,0.548,Nagpur,India,21.70N,78.75E
168793,1932-06-01,36.005,0.474,New Delhi,India,28.13N,77.27E
169549,1995-06-01,36.291,0.338,New Delhi,India,28.13N,77.27E
169753,2012-06-01,36.339,0.386,New Delhi,India,28.13N,77.27E

Again, this can be conbined into a single line of code:

In [31]:
# 
hot_india = global_temps[(global_temps['country'] == 'India') & (global_temps['ave_temp'] > 36)]
hot_india

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
64790,1932-06-01,36.005,0.474,Delhi,India,28.13N,77.27E
65546,1995-06-01,36.291,0.338,Delhi,India,28.13N,77.27E
65750,2012-06-01,36.339,0.386,Delhi,India,28.13N,77.27E
98931,1988-05-01,36.076,0.418,Jaipur,India,26.52N,75.22E
99016,1995-06-01,36.031,0.229,Jaipur,India,26.52N,75.22E
99195,2010-05-01,36.477,0.318,Jaipur,India,26.52N,75.22E
162009,1921-05-01,36.038,0.514,Nagpur,India,21.70N,78.75E
162813,1988-05-01,36.052,0.548,Nagpur,India,21.70N,78.75E
168793,1932-06-01,36.005,0.474,New Delhi,India,28.13N,77.27E
169549,1995-06-01,36.291,0.338,New Delhi,India,28.13N,77.27E
169753,2012-06-01,36.339,0.386,New Delhi,India,28.13N,77.27E

### What about rows?

Rows are a little trickier to reference because they are not arrays. In columns, we can reference the name of the columns that we are interested in. Also, the elements in a column are the same data type. Since rows contain the elements of several different arrays, they can contain multiple data types and require a different way of thinking. We can filter rows two ways: by index or by label.

For the `iloc` method, you can pass a number `[5]`, range of numbers `[5:9]`, list `[23, 45, 87]`. These values correspond to the bold index values in the first column.

`iloc`

In [33]:
# pass a value
hot_india.iloc[5]

date              2010-05-01
ave_temp              36.477
ave_temp_uncer         0.318
city                  Jaipur
country                India
latitude              26.52N
longitude             75.22E
Name: 99195, dtype: object

In [36]:
# pass a range
hot_india.iloc[3:6]

             date  ave_temp  ave_temp_uncer    city country latitude longitude
98931  1988-05-01    36.076           0.418  Jaipur   India   26.52N    75.22E
99016  1995-06-01    36.031           0.229  Jaipur   India   26.52N    75.22E
99195  2010-05-01    36.477           0.318  Jaipur   India   26.52N    75.22E

In [37]:
# pass a list
hot_india.iloc[[1, 3, 5]]

             date  ave_temp  ave_temp_uncer    city country latitude longitude
65546  1995-06-01    36.291           0.338   Delhi   India   28.13N    77.27E
98931  1988-05-01    36.076           0.418  Jaipur   India   26.52N    75.22E
99195  2010-05-01    36.477           0.318  Jaipur   India   26.52N    75.22E

`loc`

The `loc` method allows you to search for labels within the columns. You can use values, booleans, and conditionals.

In [39]:
# pass a conditional
global_temps.loc[global_temps['city'] == 'Chicago']

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
51674,1743-11-01,5.436,2.205,Chicago,United States,42.59N,87.27W
51675,1743-12-01,NaN,NaN,Chicago,United States,42.59N,87.27W
51676,1744-01-01,NaN,NaN,Chicago,United States,42.59N,87.27W
51677,1744-02-01,NaN,NaN,Chicago,United States,42.59N,87.27W
51678,1744-03-01,NaN,NaN,Chicago,United States,42.59N,87.27W
...,...,...,...,...,...,...,...
54908,2013-05-01,13.734,0.863,Chicago,United States,42.59N,87.27W
54909,2013-06-01,17.913,0.669,Chicago,United States,42.59N,87.27W
54910,2013-07-01,21.914,0.322,Chicago,United States,42.59N,87.27W
54911,2013-08-01,22.230,0.373,Chicago,United States,42.59N,87.27W
54912,2013-09-01,19.977,1.033,Chicago,United States,42.59N,87.27W

In [41]:
# pass multiple conditionals
global_temps.loc[(global_temps['city'] == 'Chicago') & (global_temps['ave_temp'] > 25)]

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude
51886,1761-07-01,27.799,2.389,Chicago,United States,42.59N,87.27W
53170,1868-07-01,25.071,0.699,Chicago,United States,42.59N,87.27W
53555,1900-08-01,25.207,0.490,Chicago,United States,42.59N,87.27W
53806,1921-07-01,25.554,0.264,Chicago,United States,42.59N,87.27W
54119,1947-08-01,26.372,0.199,Chicago,United States,42.59N,87.27W
54215,1955-08-01,25.256,0.153,Chicago,United States,42.59N,87.27W
54263,1959-08-01,25.149,0.205,Chicago,United States,42.59N,87.27W
54611,1988-08-01,25.437,0.305,Chicago,United States,42.59N,87.27W
54695,1995-08-01,25.897,0.283,Chicago,United States,42.59N,87.27W
54898,2012-07-01,25.909,0.516,Chicago,United States,42.59N,87.27W

### Working with Values

The temperatures for all the cities are in Celsius. Let's convert them to Fahrenheit so they are easier to understand.

$$ T(F) = \frac{9}{5}T(C)+32 $$

**Define a function for converting Celsius to Fahrenheit.**

In [42]:
def Celsius_to_Fahrenheit(temp_C):
    temp_F = (temp_C * 9/5) + 32
    return temp_F

**"Apply" the function to the data.**

In [45]:
global_temps['ave_temp_F'] = global_temps['ave_temp'].apply(Celsius_to_Fahrenheit)
global_temps.head()

,date,ave_temp,ave_temp_uncer,city,country,latitude,longitude,ave_temp_F
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W,80.0672
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W,81.3812
2,1849-03-01,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W,82.5818
3,1849-04-01,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W,79.0520
4,1849-05-01,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W,77.7686

# Data Analysis

In the realm of scientific computing, the ability to effectively analyze (pick apart) and interpret data is paramount. Whether you're working with experimental results, observational data, or simulations, understanding how to systematically process and summarize your data is crucial for drawing valid conclusions and advancing scientific knowledge.

## Grouping with `groupby()`

The `groupby()` method is one of the most powerful and frequently used functions in Pandas for data analysis. It allows you to split your data into groups based on some criteria, apply a function to each group independently, and then combine the results into a single dataframe or series. This process is often referred to as "split-apply-combine."

### How it Works (The "Split-Apply-Combine" Strategy):

1. **Split**: Pandas divides the dataframe into multiple sub-dataframes, where each sub-dataframe contains rows that share the same value for the specified grouping key(s).

2. **Apply**: An aggregation function (like `mean()`, `sum()`, `count()`, `max()`, `min()`, `median()`, `std()`, `var()`, or even custom functions) is applied to each individual group.

3. **Combine**: The results of the applied function from all the individual groups are then combined back into a single series or dataframe, with the grouping keys becoming the new index.

All of this can be done with a single line of code:

`df.groupby('split_group')[data_to_be_applied].function_applied_to_data`

For example, we can group the cities by country and then calculate the average temperature for each country:

In [47]:
country_data = global_temps.groupby('country')['ave_temp'].mean()
country_data.head()

country
Afghanistan    14.342919
Angola         23.693046
Australia      15.190055
Bangladesh     25.490568
Brazil         22.847555
Name: ave_temp, dtype: float64